##################################################################
###########py2与py3的不同处
########### 1.打印语句不同
########### 2.3中除法走浮点，如需整数用//
########### 3.xrange变为了range
########### 4.去掉了<>,只有!=
########### 5.去掉了''，只有repr
########### 6.没有long,只有int
########### 7.高阶函数 map、filter、zip 返回的是迭代器，不是列表对象了，而 reduce 也不再是内建函数了。
##################################################################
print('这包含的python3中与2版本间的不同')
print (1/2) 
print (1//2)

for i in range(0,3):
    print (i)

if ('1'!='1'):
    print ('right')
else:
    print ('wrong')

long_s ='12345678901234567890123456789012345678901234567890123456789012345678901234567890'
long_l =12345678901234567890123456789012345678901234567890123456789012345678901234567890
print (type(long_l))
print (repr(long_s))
print (str(long_s))