###############################################################
#####元组不可变，可以当做字典的KEY。可以把元组看做是不变的列表。
#####元组会分配给较大的内存块，而列表是分配多个较小的内存，性能上元组会比列表处理的快
###############################################################
list0=[1,2,3,4,5]
tuple0=(1,2,3,4,5)

print (list0.__sizeof__())
print (id(list0))
print (tuple0.__sizeof__())
print (id(tuple0))
tuple0=(1,2,3,4,5,6)
print (id(tuple0))

###############################################################
#####为啥有了列表还用元组？
#####元组一般用于存储异构数据
###############################################################
tuple1=("allen",38)
###############################################################
#####序列有索引
#####容器包含序列和映射，Py中唯一的内建映射是字典
#####下面中第二行代码消耗的实际更少，list()是Python函数，第二种是解释器直接实现的C函数
###############################################################
#list1=list()
list1=[]